code = true
help = true
eat = 10
energy = 10
air = 10
love = 10
#------------------------------------------------------------------------------------------------
puts '--------------------------- Virtuale pet(Beta) ---------------------------------'
puts 'Уважаемые пользователи, приложение работает в режиме "Beta"!'
puts
puts 'Это приложение, сделанное Рахмановым Сергеем, посторается симулировать Вашего '
puts 'питомца. Кормите его, укладывайте спать, выводите гулять и он Вас полюбит.    '
ansser_admin = gets.chomp
#admin
if ansser_admin == 'admin'
  puts 'Password:'
  password  = gets.chomp
  if password == 'as1kl0vp'
    system 'cls'
	  puts 'Comand:'
    comands_admin = gets.chomp
    if comands_admin == 'code_no'
      code = false
      puts 'ok'
      comands_admin = gets.chomp
    end
    if comands_admin == 'code_yes'
      code = true
      puts 'ok'
      comands_admin = gets.chomp
    end
    if comands_admin == 'help_no'
      help = false
      puts 'ok'
      comands_admin = gets.chomp
    end
    if comands_admin == 'help_yes'
      help = true
      puts 'ok'
      comands_admin = gets.chomp
    end
    if comands_admin == 'energy_0'
	  energy = 0
	  puts 'ok'
	  comands_admin = gets.chomp
	end
    if comands_admin == 'ok'
      puts 'ok'
    end
  else
    puts 'Error.'
  exit
  end
end
#Help-----
if code == true
  if help == true
    puts '================================== ПОДСКАЗКА =================================='
    puts '1) Чтобы отключить подсказку напишите "0".'
    puts '2) Первый показатель - еда, второй - энергия, 3 - желание гулять, 4 - любовь'
    puts 'к Вам.'
    puts '3) Чтобы посмотреть команды набирите "comands".'
    puts '4) Для продолжения нпжмите "5".'
    puts '==============================================================================='
  end
  ansser_for_help = gets.chomp
  if ansser_for_help == '0'
    help = false
	code = false
    puts 'Подсказка отключена. Нажмите "Enter".'
  end
  if ansser_for_help == 'comands'
    puts
    puts '1) to eat - дать поесть; 2) to sleep - уложить спать; 3) to walk - вывести гу-'
    puts 'лять; 4) to respite - ничего не делать; 5) all comands - все команды.'
  end
  if ansser_for_help == '5'
    puts 'Вы хотите начать/продолжить? Хорошо! Нажмите "Enter".'
  end
end
gets
#---------  
while 1 != 2
  system 'cls'
  puts
  puts 'Вот настроение Вашего питомца:'
  puts eat
  puts energy
  puts air
  puts love
  puts
  puts 'Напишите команду. (если не знаете набирите "comands")'
  puts 'Если хотите выйти напишите команду "exit"!'
  puts
  comand = gets.chomp
  #Help-----
  if comand == 'exit'
    puts
	puts 'Досвидания'
    exit
  end
  if code == true
    if help == true
      puts '================================== ПОДСКАЗКА =================================='
      puts '1) Чтобы отключить подсказку напишите "0".'
      puts '2) Первый показатель - еда, второй - энергия, 3 - желание гулять, 4 - любовь'
      puts 'к Вам.'
      puts '3) Чтобы посмотреть команды набирите "comands".'
      puts '4) Для продолжения нпжмите "5".'
      puts '==============================================================================='
    end
    ansser_for_help = gets.chomp
    if ansser_for_help == '0'
      help = false
	  code = false
      puts 'Подсказка отключена. Нажмите "Enter".'
    end
    if ansser_for_help == 'comands'
      puts
      puts '1) to eat - дать поесть; 2) to sleep - уложить спать; 3) to walk - вывести гу-'
      puts 'лять; 4) to respite - ничего не делать; 5) all comands - все команды.'
    end
    if ansser_for_help == '5'
      puts 'Вы хотите начать/продолжить? Хорошо! Нажмите "Enter".'
    end
  end
  gets
#---------  
#Eat==============================================================================================================
  if comand == 'to eat'
    eat = eat + 5
    energy = energy - 1
	air = air - 1
	love = love - 1
	puts 
    puts 'Вы дали Вашему питомцу поесть. Команда выполнена!'
    #Проверка
    if eat <= 0
      puts '================================================================================'
	  puts 'Ваш питомец проголодался и съел Вас!'
	  puts '================================================================================'
	  exit
	end
	if energy <= 0
	  puts
	  puts '================================================================================'
	  puts 'Ваш питомец заболел и умер!'
	  puts '================================================================================'
	  exit
	end
	if air <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец задохнулся!'
	  puts '================================================================================'
      exit	
	end
	if love <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец убежал и укусил Вас на прощание!'
	  puts '================================================================================'
	  exit
	end
  end
#Sleep==================================================================================================
  if comand == 'to sleep'
    eat = eat - 1
    energy = energy + 5
	air = air - 1
	love = love - 1
	puts 
    puts 'Вы дали Вашему питомцу поспать. Команда выполнена!'
    #Проверка
    if eat <= 0
      puts '================================================================================'
	  puts 'Ваш питомец проголодался и съел Вас!'
	  puts '================================================================================'
	  exit
	end
	if energy <= 0
	  puts
	  puts '================================================================================'
	  puts 'Ваш питомец заболел и умер!'
	  puts '================================================================================'
	  exit
	end
	if air <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец задохнулся!'
	  puts '================================================================================'
      exit	
	end
	if love <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец убежал и укусил Вас на прощание!'
	  puts '================================================================================'
	  exit
	end
  end
#Walk======================================================================================================
  if comand == 'to walk'
    eat = eat - 1
    energy = energy - 5
	air = air + 5
	love = love - 1
	puts 
    puts 'Вы дали Вашему питомцу погулять. Команда выполнена!'
    #Проверка
    if eat <= 0
      puts '================================================================================'
	  puts 'Ваш питомец проголодался и съел Вас!'
	  puts '================================================================================'
	  exit
	end
	if energy <= 0
	  puts
	  puts '================================================================================'
	  puts 'Ваш питомец заболел и умер!'
	  puts '================================================================================'
	  exit
	end
	if air <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец задохнулся!'
	  puts '================================================================================'
      exit	
	end
	if love <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец убежал и укусил Вас на прощание!'
	  puts '================================================================================'
	  exit
	end
  end
#Recpite======================================================================================================= 
  if comand == 'to recpite'
    eat = eat - 1
    energy = energy - 5
	air = air - 1
	love = love + 5
	puts 
    puts 'Вы дали Вашему питомцу ничего не делать. Команда выполнена!'
    #Проверка
    if eat <= 0
      puts '================================================================================'
	  puts 'Ваш питомец проголодался и съел Вас!'
	  puts '================================================================================'
	  exit
	end
	if energy <= 0
	  puts
	  puts '================================================================================'
	  puts 'Ваш питомец заболел и умер!'
	  puts '================================================================================'
	  exit
	end
	if air <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец задохнулся!'
	  puts '================================================================================'
      exit	
	end
	if love <= 0
	  puts '================================================================================'
	  puts 'Ваш питомец убежал и укусил Вас на прощание!'
	  puts '================================================================================'
	  exit
	end
  end
  gets
end