eat = '10'
energy = '10'
air = '10'
love = '10'
#------------------------------------------------------------------------------------------------
puts '--------------------------- Virtuale pet(Beta) --------------------------------'
puts 'Уважаемые пользователи, приложение работает в режиме "Beta"!'
puts
puts 'Это приложение, созданное Рахмановом Сергеем, предназначено для симуляции'
puts 'Вашего домашнего животного. Кормите его, ходите с ним гулять, укладывайте'
puts 'спать, и он Вас полюбит.'
 